frarohi/freebsd-src/share/man/man4/fgp.4
.\" Copyright (c) 2014 Rohit Grover <rgrover1 at gmail dot com>.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 20, 2025
.Dt FGP 4
.Os
.Sh NAME
.Nm fgp
.Nd Fountain/Geyser Apple touchpad driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines into
your kernel configuration file:
.Bd -ragged -offset indent
.Cd "device fgp"
.Cd "device hid"
.Cd "device usb"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
fgp_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the (Fountain/Geyser) family Trackpad device found in many
older Apple laptops. Both a mouse interface (/dev/fgp*)
and an evdev trackpad interface (/dev/input/event*) are provided.
.Pp
The driver simulates a three\-button mouse by combining multi\-finger tap detection
with clicking the physical button. Zero or one finger tap+click generates
a left\-button click; two\-finger tap+click maps to the right button; whereas a
three\-finger tap+click gets treated as a middle button click.
.Pp
There is support for 2\-finger horizontal and vertical scrolling.
.Pp
.Nm
supports dynamic reconfiguration using
.Xr sysctl 8 ;
through nodes under
.Nm hw.usb.fgp .
.Pp
For the
.Fa fgp*
device, pointer sensitivity can be controlled using the sysctl tunable
.Nm hw.usb.fgp.dev_move_scale_factor .
Smaller values of
.Fa dev_move_scale_factor
result in faster movement.
.Pp
For the
.Fa fgp*
device, scrolling sensitivity can be controlled using the sysctl tunable
.Nm hw.usb.fgp.dev_scroll_scale_factor .
Smaller values of
.Fa dev_scroll_scale_factor
result in faster movement.
.Pp
For the
.Fa event*
device, click+tap behaviour can be turned off via
.Nm hw.usb.fgp.evdev_button_tap_and_click .
Value 0 turns click+tap off, value 1 enables it.
.
.Sh HARDWARE
The
.Nm
driver provides support for the following Product IDs:
.Pp
.Bl -bullet -compact
.It
PowerBooks, iBooks (IDs: 0x0210, 0x0214, 0x0216)
.It
Core Duo MacBook & MacBook Pro (IDs: 0x0217, 0x0218, 0x0219)
.It
Core2 Duo MacBook & MacBook Pro (IDs: 0x021a, 0x021b, 0x021c)
.It
Core2 Duo MacBook3,1 (IDs: 0x0229, 0x022a, 0x022b)
.It
12 inch PowerBook and iBook (IDs: 0x030a, 0x030b)
.It
15 inch PowerBook (IDs: 0x020e, 0x020f, 0x0215)
.It
17 inch PowerBook (ID: 0x020d)
.El
.Pp
The newer (unibody) laptops are covered by the
.Pa wsp
driver.
.Pp
To discover the product\-id of a touchpad, search for 'Trackpad' in the
output of
.Xr lshal 1
and look up the property
.Nm usb_device.product_id .
.Sh FILES
.Nm
creates a blocking pseudo\-device file,
.Pa /dev/fgp0 ,
which presents the mouse as a
.Ar sysmouse
or
.Ar mousesystems
type device\-\-see
.Xr moused 8
for an explanation of these mouse
types.
.Pp
.Nm
creates a
.Pa /dev/input/event*
.Ar evdev
device which advertises a semi-multitouch type trackpad.
.Sh SEE ALSO
.Xr sysmouse 4 ,
.Xr usb 4 ,
.Xr loader.conf 5 ,
.Xr xorg.conf 5 Pq Pa ports/x11/xorg ,
.Xr moused 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Frank Hilgendorf Aq Mt frank.hilgendorf@posteo.de .
